In [1]:
from typing import Dict
import pandas as pd
import json
import logging
from pandas.core.frame import DataFrame

In [2]:
FILE = './datos_data_engineer.tsv'
SETTINGS = './settings.json'
SEP = '\t'
ENCODING = 'utf-16le'

In [3]:
def json_setting(json_name: str) -> Dict:
    """[summary]

    Args:
        json_name (str): [description]

    Returns:
        Dict: [description]
    """
    with open(json_name) as settings:
        json_content = json.load(settings)
    return json_content

In [4]:
def read_csv_pandas(filename: str, sep: str =',', encoding: str='utf-8') -> DataFrame:
    """[summary]

    Args:
        filename (str): [description]
        sep (str, optional): [description]. Defaults to ','.
        encoding (str, optional): [description]. Defaults to 'utf-8'.

    Returns:
        [DataFrame]: [description]
    """
    return pd.read_csv(filename, sep = sep, encoding=encoding)

In [5]:
df = read_csv_pandas(FILE,SEP,ENCODING)
data = json_setting(SETTINGS)
count_row = df.shape[0]
count_columns = df.shape[1]

In [6]:
count_nan = int((40*count_columns)/100)

In [7]:
df=df[df.isnull().sum(axis=1)<count_nan]

In [66]:
df

,id,first_name,last_name,account_number,email
0,1,Addison,Marks,196296,ornare.lectus@et.edu
1,2,Dakota,Garza,409025,scelerisque@Praesentluctus.edu
2,3,Basia,Wolfe,637720,Aliquam@nullaIntegerurna.com
3,4,Germaine,Campbell,826846,id.magna@viverraMaecenas.ca
4,5,Lenore,Pennington,345284,aliquam@Integer.edu
...,...,...,...,...,...
1002,996,Kirestin,Potts,653131,in@accumsan.co.uk
1003,997,Kristen,Stout,628705,tempus@Loremipsumdolor.edu
1004,998,Daniel,Snider,535804,porttitor.tellus.non@maurisMorbinon.com
1005,999,Simone,Mcleod,407847,et.risus@consectetuereuismod.ca
1006,1000,Hermione,Morales,478506,eu.nulla@Donec.com

In [21]:
columns = data['column_list']

In [45]:
class Columna:
    """
        Define la clase Columna con sus diferentes configuraciones
    """
    def __init__(self, setting: Dict):
        self.type = setting['type']
        self.unique = setting.get('unique', False)
        self.db_name = setting.get('db_name','')
        self.not_null = setting.get('not_null', False)
        self.regex = setting.get('regex', '')

In [53]:
for columna in columns:
    object_column = Columna(data[columna])

In [71]:
object_id = data['id']
object_id

{'type': 'int', 'unique': 'True', 'db_name': 'id', 'not_null': 'True'}

In [72]:
object_column = Columna(object_id)

In [73]:
if object_column.not_null:
    print("Hola")

Hola

In [88]:
df[df['id'].isnull()]

Empty DataFrame
Columns: [id, first_name, last_name, account_number, email]
Index: []

In [87]:
df.dropna(subset = ["id"], inplace=True)

In [89]:
df.drop_duplicates(subset = ["id"], inplace=True)

In [95]:
df[pd.to_numeric(df['id'], errors='coerce').isnull()]['id']

29         Bosley
30            NaN
84
220    Harrington
341           NaN
780       Barbara
991           NaN
Name: id, dtype: object

In [84]:
df.iloc[85]

id                                84
first_name                   Beverly
last_name                      Boyle
account_number                625739
email             Cum@atpedeCras.net
Name: 86, dtype: object

In [104]:
df[~pd.to_numeric(df['id'], errors='coerce').isnull()]

,id,first_name,last_name,account_number,email
0,1,Addison,Marks,196296,ornare.lectus@et.edu
1,2,Dakota,Garza,409025,scelerisque@Praesentluctus.edu
2,3,Basia,Wolfe,637720,Aliquam@nullaIntegerurna.com
3,4,Germaine,Campbell,826846,id.magna@viverraMaecenas.ca
4,5,Lenore,Pennington,345284,aliquam@Integer.edu
...,...,...,...,...,...
1002,996,Kirestin,Potts,653131,in@accumsan.co.uk
1003,997,Kristen,Stout,628705,tempus@Loremipsumdolor.edu
1004,998,Daniel,Snider,535804,porttitor.tellus.non@maurisMorbinon.com
1005,999,Simone,Mcleod,407847,et.risus@consectetuereuismod.ca
1006,1000,Hermione,Morales,478506,eu.nulla@Donec.com

In [116]:
df[pd.to_numeric(df['id'], errors='coerce').isnull()]

,id,first_name,last_name,account_number,email
29,Bosley,656184,NaN,NaN,NaN
30,NaN,ac.ipsum.Phasellus@ut.net,NaN,NaN,NaN
84,,531695,lectus.justo@lorem.co.uk,NaN,NaN
220,Harrington,Harrington,325378,neque.Nullam.ut@laoreetlectus.edu,NaN
341,NaN,porttitor.interdum.Sed@Loremipsum.co.uk,NaN,NaN,NaN
780,Barbara,Hurley,691210,enim.Mauris.quis@magna.net,NaN
991,NaN,157172,enim@disparturient.edu,NaN,NaN

In [114]:
pd.to_numeric(df['id'], errors='ignore')[29]

'Bosley'

In [6]:
df

,id,first_name,last_name,account_number,email
0,1,Addison,Marks,196296,ornare.lectus@et.edu
1,2,Dakota,Garza,409025,scelerisque@Praesentluctus.edu
2,3,Basia,Wolfe,637720,Aliquam@nullaIntegerurna.com
3,4,Germaine,Campbell,826846,id.magna@viverraMaecenas.ca
4,5,Lenore,Pennington,345284,aliquam@Integer.edu
...,...,...,...,...,...
1002,996,Kirestin,Potts,653131,in@accumsan.co.uk
1003,997,Kristen,Stout,628705,tempus@Loremipsumdolor.edu
1004,998,Daniel,Snider,535804,porttitor.tellus.non@maurisMorbinon.com
1005,999,Simone,Mcleod,407847,et.risus@consectetuereuismod.ca
1006,1000,Hermione,Morales,478506,eu.nulla@Donec.com

In [67]:
df['email'] = df['email'].str.strip()

In [73]:
df[df['email'].str.match('[A-Za-z0-9._%+-]+@[A-Za-z0-9.-]+\.[A-Z|a-z]{2,}')== False]

      id first_name last_name account_number                        email
110  108      Astra     Mills         442039  et.nuncnullaanteiaculis.edu

In [8]:
df[df['first_name'].isnull()]

,id,first_name,last_name,account_number,email
305,302,NaN,Copeland,547803,Vivamus.non.lorem@sed.ca
523,519,NaN,Williamson,231131,Nullam.nisl@massa.ca
605,601,NaN,Newton,601770,Duis.ac@nuncinterdum.edu
617,613,NaN,NaN,104969,dictum@Suspendisse.net
633,629,NaN,Riggs,242923,nulla.ante.iaculis@erat.net
762,758,NaN,NaN,155499,facilisis.facilisis@quamdignissimpharetra.net
775,771,NaN,NaN,935186,amet.consectetuer.adipiscing@purusgravida.net
779,775,NaN,NaN,NaN,NaN
815,810,NaN,Bishop,934203,Sed.et@at.net
853,848,NaN,Hess,340666,interdum.Nunc.sollicitudin@elementum.org
894,889,NaN,Eaton,292781,ac@idnunc.edu
983,978,NaN,NaN,958519,Aliquam.auctor.velit@fringillapurus.co.uk
993,987,NaN,Burris,233269,Sed.et@Proin.ca

In [9]:
df.dropna(subset=['first_name'], inplace=True)

In [10]:
df

,id,first_name,last_name,account_number,email
0,1,Addison,Marks,196296,ornare.lectus@et.edu
1,2,Dakota,Garza,409025,scelerisque@Praesentluctus.edu
2,3,Basia,Wolfe,637720,Aliquam@nullaIntegerurna.com
3,4,Germaine,Campbell,826846,id.magna@viverraMaecenas.ca
4,5,Lenore,Pennington,345284,aliquam@Integer.edu
...,...,...,...,...,...
1002,996,Kirestin,Potts,653131,in@accumsan.co.uk
1003,997,Kristen,Stout,628705,tempus@Loremipsumdolor.edu
1004,998,Daniel,Snider,535804,porttitor.tellus.non@maurisMorbinon.com
1005,999,Simone,Mcleod,407847,et.risus@consectetuereuismod.ca
1006,1000,Hermione,Morales,478506,eu.nulla@Donec.com